
import type { Message } from "../types/messages";

export const messages: Message[] = [
  {
    id: 1,
    time: new Date("2025-12-20T15:17:00"),
    author: "Oleksandr",
    text: "Нагадую що о 18:00 у нас заняття.",
    isOwner: false,
  },
  {
    id: 2,
    time: new Date("2025-12-20T16:42:00"),
    author: "Ем Андрій",
    text: "Я не зрозумів треба куди відправляти вам домашнє завдання у групу?",
    isOwner: false,
  },
  {
    id: 3,
    time: new Date("2025-12-20T16:44:00"),
    author: "Карімка",
    text: "Копіюєш код, створюєш з ним текстовий файл та надсилаєш його в канал.",
    isOwner: true,
  },
  {
    id: 4,
    time: new Date("2025-12-20T16:45:00"),
    author: "Ем Андрій",
    text: "Дякую!",
    isOwner: false,
  },
  {
    id: 5,
    time: new Date("2025-12-20T16:46:00"),
    author: "Карімка",
    text: "Не за що 🙂",
    isOwner: true,
  },
];